tomaskovacik/MegaCore/avr/boards.txt
##########################################################################################
## This file is created by MCUdude for use with MegaCore                                ##
## https://github.com/MCUdude/MegaCore	                                                ##
##                                                                                      ##
## This is the file where fuse settings, clock frequencies and compiler flags           ##
## are located.                                                                         ##
##                                                                                      ##
## You may change the upload serial port by modifying the upload.port field.            ##
## Note that ATmega64/128/1281/2561 only has two serial ports (UART0, UART1)            ##
## while ATmega640/1280/2560 has four serial ports (UART0, UART1, UART2, UART3).        ##
##                                                                                      ##
## The table below shows the available precompiled bootloaders for the corresponding    ##
## clock frequencies and baud rates. Modify the upload.speed field to change baud rate. ##
##                                                                                      ##
##  |            | 1000000 | 500000 | 250000 | 115200 | 57600 | 38400 | 19200 | 9600 |  ##
##  |------------|---------|--------|--------|--------|-------|-------|-------|------|  ##
##  | 20 MHz     |         |  X     |  X     |  X     |       |       |       |      |  ##
##  | 18.432 MHz |         |        |        |  X     |       |       |       |      |  ##
##  | 16 MHz     |  X      |  X     |  X     |  X     |       |       |       |      |  ##
##  | 12 MHz     |         |  X     |  X     |        |  X    |       |       |      |  ##
##  | 8 MHz      |  X      |  X     |  X     |  X     |  X    |  X    |  X    |      |  ##
##  | 4 MHz      |         |  X     |  X     |        |       |       |  X    |  X   |  ##
##  | 2 MHz      |         |        |  X     |        |       |       |  X    |  X   |  ##
##  | 1 MHz      |         |        |        |        |       |       |       |  X   |  ## 
##                                                                                      ##
##########################################################################################

# Menu options
menu.clock=Clock
menu.BOD=BOD
menu.LTO=Compiler LTO
menu.pinout=Pinout


#####################
#### ATmega2561  ####
#####################

2561.name=ATmega2561
2561.upload.tool=avrdude
2561.upload.protocol=arduino
2561.upload.maximum_size=261120
2561.upload.maximum_data_size=8192

2561.bootloader.tool=avrdude
2561.bootloader.unlock_bits=0x3f
2561.bootloader.lock_bits=0x0f

2561.build.core=MCUdude_corefiles
2561.build.variant=64-pin-avr
2561.build.mcu=atmega2561
2561.build.board=AVR_ATmega2561

# Brown out detection
2561.menu.BOD.2v7=2.7v
2561.menu.BOD.2v7.bootloader.extended_fuses=0xfd
2561.menu.BOD.4v3=4.3v
2561.menu.BOD.4v3.bootloader.extended_fuses=0xfc
2561.menu.BOD.1v8=1.8v
2561.menu.BOD.1v8.bootloader.extended_fuses=0xfe
2561.menu.BOD.disabled=Disabled
2561.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
2561.menu.LTO.Os=Disabled (default)
2561.menu.LTO.Os.compiler.c.extra_flags=
2561.menu.LTO.Os.compiler.c.elf.extra_flags=
2561.menu.LTO.Os.compiler.cpp.extra_flags=
2561.menu.LTO.Os.ltoarcmd=avr-ar

2561.menu.LTO.Os_flto=Enabled
2561.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
2561.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
2561.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
2561.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
2561.menu.clock.16MHz_external=16 MHz external
2561.menu.clock.16MHz_external.upload.port=UART0
2561.menu.clock.16MHz_external.upload.speed=115200
2561.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.16MHz_external.bootloader.high_fuses=0xd6
2561.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
2561.menu.clock.16MHz_external.build.f_cpu=16000000L

2561.menu.clock.20MHz_external=20 MHz external
2561.menu.clock.20MHz_external.upload.port=UART0
2561.menu.clock.20MHz_external.upload.speed=115200
2561.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.20MHz_external.bootloader.high_fuses=0xd6
2561.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
2561.menu.clock.20MHz_external.build.f_cpu=20000000L

2561.menu.clock.18_432MHz_external=18.432 MHz external
2561.menu.clock.18_432MHz_external.upload.port=UART0
2561.menu.clock.18_432MHz_external.upload.speed=115200
2561.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.18_432MHz_external.bootloader.high_fuses=0xd6
2561.menu.clock.18_432MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
2561.menu.clock.18_432MHz_external.build.f_cpu=18432000L

2561.menu.clock.12MHz_external=12 MHz external
2561.menu.clock.12MHz_external.upload.port=UART0
2561.menu.clock.12MHz_external.upload.speed=57600
2561.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.12MHz_external.bootloader.high_fuses=0xd6
2561.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
2561.menu.clock.12MHz_external.build.f_cpu=12000000L

2561.menu.clock.8MHz_external=8 MHz external
2561.menu.clock.8MHz_external.upload.port=UART0
2561.menu.clock.8MHz_external.upload.speed=38400
2561.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
2561.menu.clock.8MHz_external.bootloader.high_fuses=0xd6
2561.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
2561.menu.clock.8MHz_external.build.f_cpu=8000000L

2561.menu.clock.8MHz_internal=8 MHz internal
2561.menu.clock.8MHz_internal.upload.port=UART0
2561.menu.clock.8MHz_internal.upload.speed=38400
2561.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
2561.menu.clock.8MHz_internal.bootloader.high_fuses=0xd6
2561.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
2561.menu.clock.8MHz_internal.build.f_cpu=8000000L

