tomaskovacik/MegaCore/avr/boards.txt
2561.menu.clock.1MHz_internal=1 MHz internal
2561.menu.clock.1MHz_internal.upload.port=UART0
2561.menu.clock.1MHz_internal.upload.speed=9600
2561.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
2561.menu.clock.1MHz_internal.bootloader.high_fuses=0xd6
2561.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
2561.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega2560  ####
#####################

2560.name=ATmega2560
2560.upload.tool=avrdude
2560.upload.protocol=arduino
2560.upload.maximum_size=261120
2560.upload.maximum_data_size=8192

2560.bootloader.tool=avrdude
2560.bootloader.unlock_bits=0x3f
2560.bootloader.lock_bits=0x0f

2560.build.core=MCUdude_corefiles
2560.build.mcu=atmega2560
2560.build.board=AVR_ATmega2560

# Pinouts
2560.menu.pinout.mega_pinout=Arduino MEGA pinout
2560.menu.pinout.mega_pinout.build.variant=100-pin-arduino-mega
2560.menu.pinout.avr_pinout=AVR pinout
2560.menu.pinout.avr_pinout.build.variant=100-pin-avr

# Brown out detection
2560.menu.BOD.2v7=2.7v
2560.menu.BOD.2v7.bootloader.extended_fuses=0xfd
2560.menu.BOD.4v3=4.3v
2560.menu.BOD.4v3.bootloader.extended_fuses=0xfc
2560.menu.BOD.1v8=1.8v
2560.menu.BOD.1v8.bootloader.extended_fuses=0xfe
2560.menu.BOD.disabled=Disabled
2560.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
2560.menu.LTO.Os=Disabled (default)
2560.menu.LTO.Os.compiler.c.extra_flags=
2560.menu.LTO.Os.compiler.c.elf.extra_flags=
2560.menu.LTO.Os.compiler.cpp.extra_flags=
2560.menu.LTO.Os.ltoarcmd=avr-ar

2560.menu.LTO.Os_flto=Enabled
2560.menu.LTO.Os_flto.compiler.c.extra_flags=-Wextra -flto
2560.menu.LTO.Os_flto.compiler.c.elf.extra_flags=-w -flto
2560.menu.LTO.Os_flto.compiler.cpp.extra_flags=-Wextra -flto
2560.menu.LTO.Os_flto.ltoarcmd=avr-gcc-ar

# Clock frequencies
2560.menu.clock.16MHz_external=16 MHz external
2560.menu.clock.16MHz_external.upload.port=UART0
2560.menu.clock.16MHz_external.upload.speed=115200
2560.menu.clock.16MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.16MHz_external.bootloader.high_fuses=0xd6
2560.menu.clock.16MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
2560.menu.clock.16MHz_external.build.f_cpu=16000000L

2560.menu.clock.20MHz_external=20 MHz external
2560.menu.clock.20MHz_external.upload.port=UART0
2560.menu.clock.20MHz_external.upload.speed=115200
2560.menu.clock.20MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.20MHz_external.bootloader.high_fuses=0xd6
2560.menu.clock.20MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
2560.menu.clock.20MHz_external.build.f_cpu=20000000L

2560.menu.clock.18_432MHz_external=18.432 MHz external
2560.menu.clock.18_432MHz_external.upload.port=UART0
2560.menu.clock.18_432MHz_external.upload.speed=115200
2560.menu.clock.18_432MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.18_432MHz_external.bootloader.high_fuses=0xd6
2560.menu.clock.18_432MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
2560.menu.clock.18_432MHz_external.build.f_cpu=18432000L

2560.menu.clock.12MHz_external=12 MHz external
2560.menu.clock.12MHz_external.upload.port=UART0
2560.menu.clock.12MHz_external.upload.speed=57600
2560.menu.clock.12MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.12MHz_external.bootloader.high_fuses=0xd6
2560.menu.clock.12MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
2560.menu.clock.12MHz_external.build.f_cpu=12000000L

2560.menu.clock.8MHz_external=8 MHz external
2560.menu.clock.8MHz_external.upload.port=UART0
2560.menu.clock.8MHz_external.upload.speed=38400
2560.menu.clock.8MHz_external.bootloader.low_fuses=0xf7
2560.menu.clock.8MHz_external.bootloader.high_fuses=0xd6
2560.menu.clock.8MHz_external.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
2560.menu.clock.8MHz_external.build.f_cpu=8000000L

2560.menu.clock.8MHz_internal=8 MHz internal
2560.menu.clock.8MHz_internal.upload.port=UART0
2560.menu.clock.8MHz_internal.upload.speed=38400
2560.menu.clock.8MHz_internal.bootloader.low_fuses=0xe2
2560.menu.clock.8MHz_internal.bootloader.high_fuses=0xd6
2560.menu.clock.8MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
2560.menu.clock.8MHz_internal.build.f_cpu=8000000L

2560.menu.clock.1MHz_internal=1 MHz internal
2560.menu.clock.1MHz_internal.upload.port=UART0
2560.menu.clock.1MHz_internal.upload.speed=9600
2560.menu.clock.1MHz_internal.bootloader.low_fuses=0x62
2560.menu.clock.1MHz_internal.bootloader.high_fuses=0xd6
2560.menu.clock.1MHz_internal.bootloader.file=optiboot_flash/{build.mcu}/optiboot_flash_{build.mcu}_{upload.port}_{upload.speed}_{build.f_cpu}.hex
2560.menu.clock.1MHz_internal.build.f_cpu=1000000L



#####################
#### ATmega1281  ####
#####################

1281.name=ATmega1281
1281.upload.tool=avrdude
1281.upload.protocol=arduino
1281.upload.maximum_size=130048
1281.upload.maximum_data_size=8192

1281.bootloader.tool=avrdude
1281.bootloader.unlock_bits=0x3f
1281.bootloader.lock_bits=0x0f

1281.build.core=MCUdude_corefiles
1281.build.variant=64-pin-avr
1281.build.mcu=atmega1281
1281.build.board=AVR_ATmega1281

# Brown out detection
1281.menu.BOD.2v7=2.7v
1281.menu.BOD.2v7.bootloader.extended_fuses=0xfd
1281.menu.BOD.4v3=4.3v
1281.menu.BOD.4v3.bootloader.extended_fuses=0xfc
1281.menu.BOD.1v8=1.8v
1281.menu.BOD.1v8.bootloader.extended_fuses=0xfe
1281.menu.BOD.disabled=Disabled
1281.menu.BOD.disabled.bootloader.extended_fuses=0xff

# Compiler link time optimization
1281.menu.LTO.Os=Disabled (default)
1281.menu.LTO.Os.compiler.c.extra_flags=
1281.menu.LTO.Os.compiler.c.elf.extra_flags=
1281.menu.LTO.Os.compiler.cpp.extra_flags=
1281.menu.LTO.Os.ltoarcmd=avr-ar

